xunserver/remote-input/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# The firmware only uses LVGL core widgets; compiling bundled examples adds
# hundreds of source files to clean builds.
CONFIG_LV_BUILD_EXAMPLES=n
